# 30/06/2022 Q

# GIVEN DATAFRAME

In [1]:
import pandas as pd
A={"Rollno.":[1,2,3,4],"Name":["Paras Sharma","Mohan Kumar","Virat Kohli","Sugandha"],
   "UT 1":[24,18,21,22],"UT 2":[24,17,22,20],"UT 3":[20,19,18,24],"UT 4":[22,22,24,20]}
B=pd.DataFrame(A)
print(B)

   Rollno.          Name  UT 1  UT 2  UT 3  UT 4
0        1  Paras Sharma    24    24    20    22
1        2   Mohan Kumar    18    17    19    22
2        3   Virat Kohli    21    22    18    24
3        4      Sugandha    22    20    24    20

## Q1

In [2]:
print(B.loc[2])

Rollno.              3
Name       Virat Kohli
UT 1                21
UT 2                22
UT 3                18
UT 4                24
Name: 2, dtype: object

## Q2

In [3]:
print(B.loc[3])

Rollno.           4
Name       Sugandha
UT 1             22
UT 2             20
UT 3             24
UT 4             20
Name: 3, dtype: object

## Q3

In [4]:
print("EXACT NUMBER OF VALUES IN EACH COLUMN OF THE DATAFRAME IS:",B.count())

EXACT NUMBER OF VALUES IN EACH COLUMN OF THE DATAFRAME IS: Rollno.    4
Name       4
UT 1       4
UT 2       4
UT 3       4
UT 4       4
dtype: int64

## Q4

In [10]:
print(B.columns)

Index(['Rollno.', 'Name', 'UT 1', 'UT 2', 'UT 3', 'UT 4', 'Grade'], dtype='object')

## Q5

In [6]:
B["Grade"]=['A','B','A','A']
print(B)

   Rollno.          Name  UT 1  UT 2  UT 3  UT 4 Grade
0        1  Paras Sharma    24    24    20    22     A
1        2   Mohan Kumar    18    17    19    22     B
2        3   Virat Kohli    21    22    18    24     A
3        4      Sugandha    22    20    24    20     A

## Q6

In [7]:
print(B.head(3))

   Rollno.          Name  UT 1  UT 2  UT 3  UT 4 Grade
0        1  Paras Sharma    24    24    20    22     A
1        2   Mohan Kumar    18    17    19    22     B
2        3   Virat Kohli    21    22    18    24     A

## Q7

In [15]:
print(B[2:3])

   Rollno.         Name  UT 1  UT 2  UT 3  UT 4 Grade  Total
2        3  Virat Kohli    21    22    18    24     A     85

## Q8

In [31]:
B["Total"]=B["UT 1"]+B["UT 2"]+B["UT 3"]+B["UT 4"]
print(B)

   Rollno.          Name  UT 1  UT 2  UT 3  UT 4 Grade  Total
0        1  Paras Sharma    24    24    20    22     A     90
1        2   Mohan Kumar    18    17    19    22     B     76
2        3   Virat Kohli    21    22    18    24     A     85
3        4      Sugandha    22    20    24    20     A     86

## Q9

In [17]:
df=B.drop(3,axis=0)
print(df)

   Rollno.          Name  UT 1  UT 2  UT 3  UT 4 Grade  Total
0        1  Paras Sharma    24    24    20    22     A     90
1        2   Mohan Kumar    18    17    19    22     B     76
2        3   Virat Kohli    21    22    18    24     A     85

## Q10

In [20]:
print("No. of dimension of the dataframe =",df.ndim)
print("shape of the dataframe =",df.shape)

No. of dimension of the dataframe = 2
shape of the dataframe = (3, 8)

## Q11

In [21]:
print("Total no. of elements in the dataframe =",df.size)

Total no. of elements in the dataframe = 24

## Q12

In [25]:
print(df.isna())

   Rollno.   Name   UT 1   UT 2   UT 3   UT 4  Grade  Total
0    False  False  False  False  False  False  False  False
1    False  False  False  False  False  False  False  False
2    False  False  False  False  False  False  False  False

## Q13

In [33]:
print("Max value in the dataframe =\n",df.max())

Max value in the dataframe =
 Rollno.              3
Name       Virat Kohli
UT 1                24
UT 2                24
UT 3                20
UT 4                24
Grade                B
Total               90
dtype: object

## Q14

In [34]:
print("Min value in the dataframe =\n",df.min())

Min value in the dataframe =
 Rollno.              1
Name       Mohan Kumar
UT 1                18
UT 2                17
UT 3                18
UT 4                22
Grade                A
Total               76
dtype: object

# 01/07/2022 Q

# GIVEN DATAFRAME

In [3]:
import pandas as pd
df={"":["Sharad","Mansi","Kanika","Ramesh","Ankita","Pranay"],
   "UT 1":[57,86,92,52,93,98],"Half Yearly":[83,67,78,84,75,79],
   "UT 2":[49,87,45,55,87,88],"Final":[89,90,66,78,69,96]}
K=pd.DataFrame(df)
print(K)

           UT 1  Half Yearly  UT 2  Final
0  Sharad    57           83    49     89
1   Mansi    86           67    87     90
2  Kanika    92           78    45     66
3  Ramesh    52           84    55     78
4  Ankita    93           75    87     69
5  Pranay    98           79    88     96

## Q1

In [13]:
L=K.rename({"":"Roll no."},axis=1)
L["Roll no."]=[1,2,3,4,5,6]
print(L)

   Roll no.  UT 1  Half Yearly  UT 2  Final
0         1    57           83    49     89
1         2    86           67    87     90
2         3    92           78    45     66
3         4    52           84    55     78
4         5    93           75    87     69
5         6    98           79    88     96

# Q2